{
    "mystery": {
      "characterArc": {
        "characterArc1": "Sleuth\nThis is the person who will ultimately solve the crime. Male, female; brilliant (Sherlock Holmes), bumbling (Columbo). This is your hero. This person has to be likeable enough for your readers to root for and smart enough that it's believable when he or she solves the crime.",
        "characterArc2": "Sidekick\nThis person is the foil for the sleuth. The sleuth will bounce ideas off the sidekick, and sometimes the sidekick will either discover the missing piece of the puzzle or jumpstart the discussion or discovery that leads to a breakthrough. The sidekick can be a love interest, but often it's better if the love interest is a third party, often one who finds him or herself in danger.",
        "characterArc3": "The Reluctant Hero\nA character who is drawn into a mystery against their will but ultimately uncovers the truth.\nExample: Raymond Chandler's Philip Marlowe.",
        "characterArc4": "Villain\nThis is the person who the sleuth is chasing. He or she is either mentioned or around throughout the novel, but doesn't seem guilty until near the end. Clues will have to be left, though, so that, if the reader re-reads the book, the guilt is apparent.",
        "characterArc5": "Red Herring\nThe red herring is the distraction. The sleuth mistakenly pursues this person early on, and doesn't discover the red herring's innocence until late. It's especially poignant if the red herring can be made to be sympathetic, particularly if he or she can be made loveable and then can maybe be framed and eliminated by the villain.",
        "characterArc6": "The Femme Fatale\nA mysterious, alluring woman who may have ulterior motives and often leads the protagonist into dangerous situations.\nExample: Veronica Lake's character in This Gun for Hire.",
        "characterArc7": "The Innocent Bystander\nAn ordinary person who gets caught up in the mystery and must navigate the dangers to uncover the truth.\nExample: The \"everyman\" in Rear Window.",
        "characterArc8": "The World-Weary Detective\nA seasoned, often jaded investigator who has seen it all but is still compelled to seek justice despite personal cost.\nExample: Sam Spade from The Maltese Falcon."
      },
      "plotArc": {
        "plotArc1": "Misdirection\nThe most important part of writing mysteries is misdirecting the reader. All the clues need to be given, but in a way so that the reader may not notice them until the time is right. A great way to do that is to list several items found on a bookcase or desk, and bury the important one in the middle of the list before moving on to a different part of the room. The clue has been given, but neither the sleuth nor the reader has realized the significance yet.",
        "plotArc2": "Significance\nWe've all heard of Chekhov's gun. Nowhere is it more poignant than in mysteries. If something is called attention to in the beginning of the book, it's a significant clue. Make use of it by the end.",
        "plotArc3": "Timing\nClues introduced right before action scenes might be missed by the reader. That's a good way to bury something you want the reader to know but temporarily forget. They'll be so caught up in the action, they might not remember the clue you’ve introduced.",
        "plotArc4": "Reveal and Recap\nClues need to be spaced out throughout the novel. If they all came at the beginning, there would be no novel to read. The sleuth would solve it immediately. If they all came at the end, what would the sleuth do for 300+ pages? Space the clues out, and have the sleuth recap his knowledge once and a while (definitely before the villain is revealed) so the reader can regroup with him.",
        "plotArc5": "The Crime or Central Mystery\nThe story typically revolves around a central crime or enigma that must be solved. This could be a murder, theft, disappearance, or puzzle that leaves the characters (and readers) guessing. The opening scene often sets this up dramatically to hook the reader.",
        "plotArc6": "The False Resolution\nA moment where it seems the mystery is solved, only for new evidence or events to prove otherwise.",
        "plotArc7": "The Showdown\nThe climactic confrontation between the sleuth and the antagonist, where the truth is revealed, and the sleuth often faces physical or moral peril.",
        "plotArc8": "The Resolution\nThe story concludes with the crime explained and justice served-or sometimes, a morally ambiguous ending where not everything is tied up neatly."
      },
      "storyExcerpts": "The tide. But a human body is a different matter. There is a fierce eddy between the wharf and the house. It seemed likely enough that the weighted coat had remained when the stripped body had been sucked away into the river. ...",
      "dialogue": {
        "dialogue1": "\"I do.\"\n\"Murdered?\"\n\"I don't say that. Perhaps.\"\n\"And on what day did he meet his death?\"\n\"On Monday.\"\n\"Then perhaps, Mr. Holmes, you will be good enough to explain how it is that I have received a letter from him to-day.\"\nSherlock Holmes sprang out of his chair as if he had been galvanized.\n\"What!\" he roared.\n\"Yes, to-day.\" She stood smiling, holding up a little slip of paper in the air.\n\"May I see it?\"\n\"Certainly.\"",
        "dialogue2": "\"Yes, there was a ring. His signet-ring.\"\n\"And you are sure that this is your husband's hand?\"\n\"One of his hands.\"\n\"One?\"\n\"His hand when he wrote hurriedly. It is very unlike his usual writing, and yet I know it well.\"\n\"'Dearest do not be frightened. All will come well. There is a huge error which it may take some little time to rectify. Wait in patience.-NEVILLE.' Written in pencil upon the flyleaf of a book, octavo size, no water-mark. Hum! Posted to-day in Gravesend by a man with a dirty thumb. Ha! And the flap has been gummed, if I am not very much in error, by a person who had been chewing tobacco. And you have no doubt that it is your husband's hand, madam?\"\n\"None. Neville wrote those words.\"",
        "dialogue3": "\"The goose, Mr. Holmes! The goose, sir!\" he gasped.\n\"Eh? What of it, then? Has it returned to life and flapped off through the kitchen window?\" Holmes twisted himself round upon the sofa to get a fairer view of the man's excited face.\n\"See here, sir! See what my wife found in its crop!\" He held out his hand and displayed upon the centre of the palm a brilliantly scintillating blue stone, rather smaller than a bean in size, but of such purity and radiance that it twinkled like an electric point in the dark hollow of his hand.\nSherlock Holmes sat up with a whistle. \"By Jove, Peterson!\" said he, \"this is treasure trove indeed. I suppose you know what you have got?\"",
        "dialogue4": "\"Detective: 'You say you didn't see anything, but you were the last person to speak to the victim.'\nSuspect: 'I didn't know him well, I swear. We just exchanged a few words.'\nDetective: 'And what did you say exactly?'\nSuspect: 'I-I just asked him about the weather...'\"",
        "dialogue5": "\"Partner: 'We've got two suspects, but neither of them are talking.'\nDetective: 'That's fine. People always talk when they think they're not being watched.'\nPartner: 'You mean, you're watching them?'\nDetective: 'No. I'm watching the people watching them.'\"",
        "dialogue6": "\"Stranger: 'You don't know what you're getting into.'\nProtagonist: 'Maybe. But I'm already in it.'\nStranger: 'It's more dangerous than you think.'\nProtagonist: 'That's why I'm not backing down.'\"",
        "dialogue7": "\"Detective: 'You say you heard a noise, but didn't see anything. Can you describe the noise?'\nWitness: 'It was a thud... then silence. I thought it was just a door slamming.'\nDetective: 'A door that sounds like a body falling?'\nWitness: 'I guess not...'\"",
        "dialogue8": "\"Informant: 'I heard things. Things you don't want to know.'\nDetective: 'Try me.'\nInformant: 'You're not ready for this. You don't know who you're up against.'\nDetective: 'I'm already in too deep. Start talking.'\""
      },
      "badDialogue": {
        "dialogue1": "\"Detective: 'I suspect you're the murderer.'\nSuspect: 'I am not the murderer!'\nDetective: 'But you were near the scene of the crime and you had motive!'\nSuspect: 'I didn’t do it!'\"",
        "dialogue2": "\"Detective: 'The case is over. I know everything.'\nSuspect: 'What do you know?'\nDetective: 'You did it, didn't you?'\nSuspect: 'What?'\""
      }
    }
  }
  