{
    "scifi": {
      "characterArc": {
        "characterArc1": "The straight-up combat guy.",
        "characterArc2": "The sneaky/disreputable guy.",
        "characterArc3": "Concerned with abstract knowledge.",
        "characterArc4": "Concerned with practical/technological knowledge.",
        "characterArc5": "These characters are basically Space fascists. Spock put it best in Star Trek II: 'Superior intelligence breeds superior ambition.' So, the minute anyone’s genetics get spruced up a bit, they figure they’ve got to take over the galaxy. Sorry — we’re not buying it. Really smart people should be able to figure out that ruling the galaxy’s a huge hassle and let other people conquer the world for them while they put their superior feet up on some superior sofa (we assume, from some sort of space Ikea).",
        "characterArc6": "Almost no one ever plans to travel in time — they have to bumble and accidentally stumble into the past in a way that would embarrass even Don Knotts. They either get zapped there by a daffy scientist or fall through a machine or get struck by lightning — which is the best evidence we have that time travel doesn’t exist.",
        "characterArc7": "Whether they be clones, robots or alternate reality versions, evil twins eventually show up in just about every sci-fi property — looking just enough like the regular version to fool everyone that knows them, but different enough that the viewer wonders why everyone on the show is an idiot.",
        "characterArc8": "If there’s a more pernicious robo-stereotype than the wanna-be meatbags, it’s the robots that are programmed to be 2000% more bumbling than humans can ever be. Sometimes they’re overly cute (Twiki), sometimes they’re overly serious (C-3PO) and sometimes they’re a ball filled with rodeo clown Slim Pickens (Old B.O.B.), but they’re all apparently programmed to be not only annoying robots, but annoying people.",
        "characterArc9": "While Earth’s future is always as multi-cultural as a Benneton ad, how many alien planets can say the same? Every alien world is exactly one big homogeneous lump, be it all desert, ice, jungle or junk, and every one of that planet’s species is likewise the same. For example, every Vulcan’s pretty much the same as Spock, it’s just that some have bigger breasts and trouble staying out of saunas."
      },
      "plotArcs": {
        "plotArc1": "Time travel",
        "plotArc2": "Teleportation",
        "plotArc3": "Mind control, telepathy, and telekinesis",
        "plotArc4": "Aliens, extraterrestrial lifeforms, and mutants",
        "plotArc5": "Space travel and exploration",
        "plotArc6": "Interplanetary warfare",
        "plotArc7": "Parallel universes",
        "plotArc8": "Fictional worlds"
      },
      "storyExcerpts": "vivid colouring returned upon the world once more, I scanned the view keenly. But I saw no vestige of my white figures. They were mere creatures of the half-light. ‘They must have been ghosts,’ I said; ‘I wonder whence they dated.’ For a queer notion of Grant Allen’s came into my head, and amused me. If each generation die and leave ghosts, he argued, the world at last will get overcrowded with them. On that theory they would have grown innumerable some Eight Hundred Thousand Years hence, and it was no great wonder to see four at once. But the jest was unsatisfying, and I was thinking of these figures all the morning, until Weena’s rescue drove them out of my head. I associated them in some indefinite way with the white animal I had startled in my first passionate search for the Time Machine. But Weena was a pleasant substitute. Yet all the same, they were soon destined to take far deadlier possession of my mind. “I think I have said how much hotter than our own was the weather of this Golden Age. I cannot account for it. It may be that the sun was hotter, or the earth nearer the sun. It is usual to assume that the sun will go on cooling steadily in the future. But people, unfamiliar with such speculations as those of the younger Darwin, forget that the planets must ultimately fall back one by one into the parent body. As these catastrophes occur, the sun will blaze with renewed energy; and it may be that some inner planet had suffered this fate. Whatever the reason, the fact remains that the sun was very much hotter than we know it. “Well, one very hot morning—my fourth, I think—as I was seeking shelter from the heat and glare in a colossal ruin near the great house where I slept and fed, there happened this strange thing. Clambering among these heaps of masonry, I found a narrow gallery, whose end and side windows were blocked by fallen masses of stone. By contrast with the brilliancy outside, it seemed at first impenetrably dark to me. I entered it groping, for the change from light to blackness made spots of colour swim before me. Suddenly I halted spellbound. A pair of eyes, luminous by reflection against the daylight without, was watching me out of the darkness. “The old instinctive dread of wild beasts came upon me. I clenched my hands and steadfastly looked into the glaring eyeballs. I was afraid to turn. Then the thought of the absolute security in which humanity appeared to be living came to my mind. And then I remembered that strange terror of the dark. Overcoming my fear to some extent, I advanced a step and spoke. I will admit that my voice was harsh and ill-controlled. I put out my hand and touched something soft. At once the eyes darted sideways, and something white ran past me. I turned with my heart in my mouth, and saw a queer little ape-like figure, its head held down in a peculiar manner, running across the sunlit space behind me. It blundered against a block of granite, staggered aside, and in a moment was hidden in a black shadow beneath another pile of ruined masonry. “My impression of it is, of course, imperfect; but I know it was a dull white, and had strange large greyish-red eyes; also that there was flaxen hair on its head and down its back. But, as I say, it went too fast for me to see distinctly. I cannot even say whether it ran on all fours, or only with its forearms held very low. After an instant’s pause I followed it into the second heap of ruins. I could not find it at first; but, after a time in the profound obscurity, I came upon one of those round well-like openings of which I have told you, half closed by a fallen pillar. A sudden thought came to me. Could this Thing have vanished down the shaft? I lit a match, and, looking down, I saw a small, white, moving creature, with large bright eyes which regarded me steadfastly as it retreated. It made me shudder. It was so like a human spider! It was clambering down the wall, and now I saw for the first time a number of metal foot and hand rests forming a kind of ladder down the shaft. Then the light burned my fingers and fell out of my hand, going out as it dropped, and when I had lit another the little monster had disappeared. “I do not know how long I sat peering down that well. It was not for some time that I could succeed in persuading myself that the thing I had seen was human. But, gradually, the truth dawned on me: that Man had not remained one species, but had differentiated into two distinct animals: that my graceful children of the Upper World were not the sole descendants of our generation, but that this bleached, obscene, nocturnal Thing, which had flashed before me, was also heir to all the ages. “I thought of the flickering pillars and of my theory of an underground ventilation. I began to suspect their true import. And what, I wondered, was this Lemur doing in my scheme of a perfectly balanced organisation? How was it related to the indolent serenity of the beautiful Overworlders? And what was hidden down there, at the foot of that shaft? I sat upon the edge of the well telling myself that, at any rate, there was nothing to fear, and that there I must descend for the solution of my difficulties. And withal I was absolutely afraid to go! As I hesitated, two of the beautiful upperworld people came running in their amorous sport across the daylight in the shadow. The male pursued the female, flinging flowers at her as he ran. “They seemed distressed to find me, my arm against the overturned pillar, peering down the well. Apparently it was considered bad form to remark these apertures; for when I pointed to this one, and tried to frame a question about it in their tongue, they were still more visibly distressed and turned away. But they were interested by my matches, and I struck some to amuse them. I tried them again about the well, and again I failed. So presently I left them, meaning to go back to Weena, and see what I could get from her. But my mind",
      "dialogue": {
        "dialogue1": "\"If we don’t get the reactor back online, the whole colony will lose power.\" \n\"It’s not that simple. We need a stabilizer crystal, and the nearest one is light-years away.\" \n\"Then we need to find a way to get there faster.\"",
        "dialogue2": "\"You’re not even from this galaxy, are you?\" \n\"No, but I’ve been around long enough to learn a few things.\"",
        "dialogue3": "\"We can’t just keep running forever.\" \n\"We’ve got no choice. They’re after us.\"",
        "dialogue4": "\"You’re telling me that we’re the last hope for the galaxy?\" \n\"We’re not the only hope, but we’re the most unlikely.\""
      },
      "settings": {
        "setting1": "Small Towns",
        "setting2": "Big Cities",
        "setting3": "Isolated Spaces",
        "setting4": "Workplace",
        "setting5": "Academic Institution",
        "setting6": "Travel Destination",
        "setting7": "Historical Settings",
        "setting8": "Fantastical World"
      }
    }
  }
  